j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Why shouldn't Hawai`i comply with federal law?
   CLOSED: [2018-06-23 Sat 07:43]
   :PROPERTIES:
   :EXPORT_FILE_NAME: comply-with-feds
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:
The federal government is following the law in trying to remove illegal aliens.
Why should the State refuse to comply with federal law?


*** Background:

Immigration and the enforcement of immigration law is a federal function, not a
state function.  State and county law enforcement agents, such as the sheriff or
the local police, are not legally required to enforce immigration law.

The State of Hawai`i and its counties receive no federal funds to support federal
immigration programs.

Yet President Trump wants states and their local governments to help federal
immigration agencies, such as the federal Immigration and Customs Enforcement
agency (ICE). For example, Trump wants local police to act as ICE agents to help
identify and deport all undocumented immigrants.

*** Answer:
Hawai`i *is* following the law. Importantly, Hawai`i will continue to follow the
law if it enacts a sanctuary law, such as the Ho`okipa bill introduced during
the 2018 legislative session.

