j20-immigration/content/post/comply-with-feds.md
+++
title = "Why shouldn't Hawai`i comply with federal law?"
author = ["Hawaii J20"]
date = 2018-06-23T07:43:00-10:00
lastmod = 2018-08-04T18:04:08-10:00
draft = false
[menu.main]
  weight = 2004
  identifier = "why-shouldn-t-hawai-i-comply-with-federal-law"
+++

## Question: {#question}

The federal government is following the law in trying to remove illegal aliens.
Why should the State refuse to comply with federal law?


## Background: {#background}

Immigration and the enforcement of immigration law is a federal function, not a
state function.  State and county law enforcement agents, such as the sheriff or
the local police, are not legally required to enforce immigration law.

The State of Hawai\`i and its counties receive no federal funds to support federal
immigration programs.

Yet President Trump wants states and their local governments to help federal
immigration agencies, such as the federal Immigration and Customs Enforcement
agency (ICE). For example, Trump wants local police to act as ICE agents to help
identify and deport all undocumented immigrants.


## Answer: {#answer}

Hawai\`i **is** following the law. Importantly, Hawai\`i will continue to follow the
law if it enacts a sanctuary law, such as the Ho\`okipa bill introduced during
the 2018 legislative session.
